<a href="https://colab.research.google.com/github/HusanJalilov/AI_Jpyuter_/blob/main/pandas/pandas_datafream_1_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd
data={
    "ranglar":[122,33,44,12,45,776,224],
    "Turlari":[22,12,45,75,35,77,111]
}

In [8]:
df=pd.DataFrame(data)

In [9]:
df

   ranglar  Turlari
0      122       22
1       33       12
2       44       45
3       12       75
4       45       35
5      776       77
6      224      111

In [11]:
df.head(2)

   ranglar  Turlari
0      122       22
1       33       12

In [15]:
df.loc[1:2]

   ranglar  Turlari
1       33       12
2       44       45

In [16]:
df.loc